Revit 2027 API
NumberingFormattedParameter.SetParameter Method
 Set the target parameter for formatting.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetParameter(
	NumberingParameter parameter
)
Public Sub SetParameter (
	parameter As NumberingParameter
)
public:
void SetParameter(
	NumberingParameter^ parameter
)
member SetParameter :
        parameter : NumberingParameter -> unit
Parameters
parameter NumberingParameter
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
NumberingFormattedParameter Class
Autodesk.Revit.DB Namespace